{
  "TRANSLATE": {
    "ko": {
      "Forum": "포럼",
      "Post": "게시물",
      "Profile": "프로필",
      "Filter": "필터",
      "Category": "카테고리",
      "Time": "시간",
      "Age": "나이",
      "Country": "국가",
      "Gender": "성별",
      "Search": "검색",
      "Reset": "초기화",
      "Living": "생활",
      "Career": "커리어",
      "Food": "음식",
      "RelationShip": "인간 관계",
      "none": "없음",
      "None": "없음",
      "5 min": "5분",
      "30 min": "30분",
      "1 hr": "1시간",
      "1 day": "하루",
      "Options": "옵션",
      "Title": "제목",
      "Description": "설명",
      "Title_Description": "제목...",
      "Description_Description": "설명...",
      "Discard_Alert": "변경 사항을 삭제하시겠습니까?",
      "Discard_Alert_message": "저장되지 않은 변경 사항이 있습니다. 변경 사항을 삭제하고 나가시겠습니까?",
      "Discard_Alert_confirm": "삭제",
      "Discard_Alert_cancel": "취소",
      "Contents": "내용",
      "Comment": "댓글",
      "Report": "신고",
      "Written_Questions": "작성한 질문",
      "Commented_Questions": "댓글 단 질문",
      "About_Me": "자기소개",
      "User_Information": "사용자 정보",
      "Settings": "설정",
      "Account": "계정",
      "Privacy_Security": "개인정보 및 보안",
      "Themes": "테마",
      "Languages": "언어",
      "About": "정보",
      "LogOut": "로그아웃",
      "System_Mode": "시스템 모드",
      "System_Mode_Description": "운영 체제 설정에서 모드를 자동으로 적용",
      "Dark Mode": "다크 모드",
      "Light Mode": "라이트 모드",
      "Default": "기본",
      "Email": "이메일",
      "Occupation": "직업",
      "Delete_Account": "계정 삭제",
      "Lock_Screen": "화면 잠금",
      "Change_the_Password": "비밀번호 변경",
      "Security": "보안",
      "Enter_Password": "비밀번호 입력",
      "Change_Password": "비밀번호 변경",
      "App_Version": "앱 버전",
      "Cancel": "취소",
      "OK": "확인",
      "Male": "남성",
      "Female": "여성",
      "Edit_User": "사용자 편집",
      "Confirm": "확인",
      "Upload": "업로드",
      "Delete": "삭제",
      "Report_Question": "질문 신고",
      "Report_Question_message": "이 질문을 신고하시겠습니까?",
      "Delete_question": "질문 삭제",
      "Delete_question_message": "이 질문을 삭제하시겠습니까?",
      "Report_Comment": "댓글 신고",
      "Report_Comment_message": "이 댓글을 신고하시겠습니까?",
      "Im_From": "출신",
      "Im": "저는",
      "old": "세",
      "Delete_Account_message": "계정을 삭제하시겠습니까?",
      "Terms_Conditions": "이용 약관\n",
      "Terms_Conditions_message": "이용 약관은 Younghoon Yu(이하 '서비스 제공자')가 무료로 제공하는 모바일 애플리케이션 P4U(이하 '애플리케이션')에 적용됩니다. 애플리케이션을 다운로드하거나 사용함으로써 귀하는 자동으로 다음 약관에 동의하게 됩니다. 애플리케이션의 무단 복제, 수정, 소스 코드 추출, 다른 언어로의 번역 또는 파생 버전 생성은 엄격히 금지됩니다. 애플리케이션과 관련된 모든 지적 재산권은 서비스 제공자에게 귀속됩니다. 서비스 제공자는 애플리케이션을 유용하고 효율적으로 유지하기 위해 언제든지 애플리케이션을 수정하거나 서비스에 대한 요금을 부과할 권리를 보유합니다. 애플리케이션은 귀하가 제공한 개인 데이터를 저장 및 처리하여 서비스를 제공합니다. 휴대폰과 애플리케이션 접근의 보안을 유지하는 것은 귀하의 책임입니다. 서비스 제공자는 휴대폰의 보안 기능을 손상시킬 수 있는 탈옥이나 루팅을 강력히 권장하지 않습니다.\n\n",
      "Location-Based_Information": "위치 기반 정보\n",
      "Location-Based_Information_message": "애플리케이션은 사용자 경험을 향상시키고 위치 기반 서비스를 제공하기 위해 위치 정보를 수집 및 사용합니다. 이는 GPS, Wi-Fi 또는 모바일 네트워크를 통해 얻은 대략적 또는 정확한 위치 데이터를 포함할 수 있습니다. 서비스 제공자는 이러한 데이터가 개인정보 보호 규정을 준수하여 처리되며, 허가되지 않은 제3자와 공유되지 않도록 보장합니다. 사용자는 장치 설정에서 위치 서비스를 비활성화하여 위치 데이터 공유를 중단할 수 있습니다.\n\n",
      "Youth_Protection_Policy": "청소년 보호 정책\n",
      "Youth_Protection_Policy_message": "서비스 제공자는 모든 연령대의 사용자에게 안전하고 적절한 경험을 제공하기 위해 노력합니다. 애플리케이션이 미성년자에 의해 사용되는 경우, 부모나 보호자의 감독이 권장됩니다. 애플리케이션은 부모의 동의 없이 13세 미만 아동의 개인 정보를 의도적으로 수집하지 않습니다. 부모나 보호자가 자녀가 동의 없이 개인 데이터를 제공한 것을 발견한 경우, 서비스 제공자에게 즉시 연락하여 해당 정보를 삭제하도록 요청해야 합니다. 서비스 제공자는 젊은 사용자의 안전을 보장하기 위해 특정 기능에 대한 접근을 제한할 권리를 보유합니다. 애플리케이션은 자체 약관을 가진 제3자 서비스를 활용합니다. 아래는 애플리케이션에서 사용하는 제3자 서비스 제공자의 약관 링크입니다:\n\n* Google 로그인 서비스\n* Apple 로그인 서비스\n* AdMob\n\n서비스 제공자는 특정 측면에 대한 책임을 지지 않습니다. 애플리케이션의 일부 기능은 Wi-Fi 또는 모바일 네트워크 제공업체가 제공하는 활성 인터넷 연결이 필요합니다. Wi-Fi에 접근할 수 없거나 데이터 허용량을 초과한 경우, 애플리케이션이 완전한 기능을 수행하지 못할 수 있으며, 이에 대해 서비스 제공자는 책임을 지지 않습니다.\n\nWi-Fi 영역 외부에서 애플리케이션을 사용하는 경우, 모바일 네트워크 제공업체의 계약 조건이 여전히 적용됩니다. 따라서 애플리케이션에 연결하는 동안 데이터 사용에 대한 요금이나 기타 제3자 요금이 발생할 수 있습니다. 애플리케이션을 사용함으로써 귀하는 이러한 요금에 대한 책임을 수락하게 됩니다. 애플리케이션을 사용하는 장치의 요금 지불자가 아닌 경우, 귀하는 요금 지불자로부터 허가를 받았다고 간주됩니다.\n\n마찬가지로, 서비스 제공자는 귀하의 애플리케이션 사용에 대한 책임을 항상 지지 않습니다. 예를 들어, 장치의 배터리가 방전되어 서비스를 이용할 수 없는 경우, 서비스 제공자는 책임을 지지 않습니다.\n\n서비스 제공자는 애플리케이션을 최신 상태로 유지하고 정확하게 유지하기 위해 노력하지만, 제3자로부터 정보를 제공받아 이를 귀하에게 제공하므로, 이러한 기능에 전적으로 의존하여 발생하는 손실에 대해 책임을 지지 않습니다.\n\n서비스 제공자는 향후 애플리케이션을 업데이트할 수 있습니다. 애플리케이션은 현재 운영 체제의 요구 사항에 따라 제공되며, 추가 시스템에 대한 지원이 결정될 수 있습니다. 애플리케이션을 계속 사용하려면 업데이트를 다운로드해야 할 수 있습니다. 서비스 제공자는 애플리케이션이 항상 귀하에게 적합하거나 장치에 설치된 특정 운영 체제 버전과 호환되도록 업데이트될 것을 보장하지 않습니다. 그러나 귀하는 제공되는 업데이트를 항상 수락하는 데 동의합니다. 서비스 제공자는 애플리케이션 제공을 중단하고 언제든지 사용을 종료할 수 있으며, 종료 통지를 제공하지 않을 수 있습니다. 달리 통지하지 않는 한, 종료 시 (a) 귀하에게 부여된 권리와 라이선스는 종료되며; (b) 귀하는 애플리케이션 사용을 중단하고, 필요에 따라 장치에서 삭제해야 합니다.\n\n",
      "Changes_Terms_Conditions": "이용 약관 변경\n",
      "Changes_Terms_Conditions_message": "서비스 제공자는 주기적으로 이용 약관을 업데이트할 수 있습니다. 따라서 변경 사항을 정기적으로 검토하는 것이 권장됩니다. 서비스 제공자는 이 페이지에 새로운 이용 약관을 게시하여 변경 사항을 통지할 것입니다.\n\n이 이용 약관은 2025년 2월 22일부터 유효합니다.\n\n",
      "Contact_us": "문의하기\n",
      "Contact_us_message": "이용 약관에 대한 질문이나 제안이 있으시면, 0623hoon@gmail.com으로 서비스 제공자에게 문의해 주시기 바랍니다.\n\n",
      "Delete_Comment": "댓글 삭제",
      "Delete_Comment_message": "이 댓글을 삭제하시겠습니까?",
      "LogOut_message": "로그아웃하시겠습니까?",
      "Occupation_Input": "직업을 입력하세요",
      "New_User": "신규 사용자",
      "Edit": "수정",
      "Post_Alert_message": "모든 항목을 입력해주세요",
      "Social_Login": "소셜 로그인",
      "All_Term": "모든 이용 약관 동의",
      "All_Term_message": "전체 동의는 P4U에서 제공하는 모든 정보를 개별적으로 동의하는 것을 의미합니다.",
      "Gender_Term": "성별에 대한 선택적 정보를 수집할 수 있으며, '남성', '여성', '없음'이 포함될 수 있습니다.\n\n수집 목적:\n- 사용자 인구 통계 파악\n- 서비스 및 사용자 경험 개선\n- 디자인 및 콘텐츠 결정에서 다양성과 포용성 보장\n\n선택 사항:\n- 성별 정보 제공은 전적으로 선택 사항입니다.\n- '없음'을 선택하거나 아예 제공하지 않아도 됩니다.\n- 언제든지 성별 정보를 열람, 수정 또는 삭제 요청할 수 있습니다.",
      "Country_Term": "위치 정보를 수집하고 사용할 수 있습니다:\n\n기기의 IP 주소, Wi-Fi 또는 기타 기술을 통해 위치 데이터를 수집할 수 있습니다.\n\n위치 기반 서비스 제공, 사용자 경험 향상, 서비스 개선 및 분석 목적으로 사용됩니다.\n\n명시적 동의 없이 제3자와 정확한 위치 데이터를 공유하지 않으며, 법적 요구 또는 요청한 서비스 제공 시에만 공유됩니다.",
      "Mandatory": "필수",
      "SNS_Term": "개인 정보 제3자 동의",
      "User_Term": "사용자는 부적절한 질문이나 댓글을 신고할 수 있습니다. 3명에게 신고된 사용자는 악용 사용자로 계정이 차단됩니다.",
      "Age_Term": "나이 정보 수집\n회원가입 과정에서 나이를 수집할 수 있으며, 이 정보는 맞춤형 콘텐츠, 광고, 서비스를 제공하는 데 사용됩니다.\n\n연령대 수집:\n사용자 인구 통계를 이해하고 분석하기 위해 나이 또는 연령대를 수집할 수 있습니다.\n\n개인화된 콘텐츠 및 광고:\n사용자의 나이에 따라 앱 내 콘텐츠 및 광고를 맞춤 제공합니다.\n\n활용 목적:\n- 내부 분석 보고서 작성\n- 연령에 맞는 사용자 경험 제공\n\n데이터 보안:\n모든 데이터는 안전하게 저장되며, 법적 요구가 없는 한 명시적 동의 없이 제3자에게 공유되지 않습니다.\n\n사용자의 권리:\n언제든지 나이 정보를 포함한 개인 정보를 수정 또는 삭제할 수 있습니다.",
      "Term_Button": "동의하고 계속하기",
      "See_detail": "자세히 보기",
      "User_Provided_information": "사용자가 제공한 정보",
      "Term_bottom_message": "사용자는 계정을 삭제할 수 있습니다. 삭제 후에는 모든 질문과 댓글이 삭제됩니다.",
      "User_logout_message": "사용자 로그아웃",
      "Question_deleted_message": "질문이 삭제되었습니다",
      "Comment_deleted_message": "댓글이 삭제되었습니다",
      "Account_deleted_message": "계정이 삭제되었습니다",
      "Reported_Question_message": "신고된 질문",
      "Reported_Comment_message": "신고된 댓글",
      "Question_created_message": "질문이 생성되었습니다",
      "Question_updated_message": "질문이 수정되었습니다",
      "Question_created_error_message": "질문 생성 실패",
      "OAuth2Login_error_message": "소셜 로그인 응답 없음",
      "QAuth2Login_error_login_message": "로그인 실패",
      "GetUserDetail_error_message": "사용자 정보 불러오기 실패",
      "PostQuestion_error_message": "질문 생성 실패",
      "UpdateQuestion_error_message": "질문 수정 실패"
    },
    "en": {
      "Forum": "Forum",
      "Post": "Post",
      "Profile": "Profile",
      "Filter": "Filter",
      "Category": "Category",
      "Time": "Time",
      "Age": "Age",
      "Country": "Country",
      "Gender": "Gender",
      "Search": "Search",
      "Reset": "Reset",
      "Living": "Living",
      "Career": "Career",
      "Food": "Food",
      "RelationShip": "RelationShip",
      "none": "none",
      "None": "None",
      "5 min": "5 min",
      "30 min": "30 min",
      "1 hr": "1 hr",
      "1 day": "1 day",
      "Options": "Options",
      "Title": "Title",
      "Description": "Description",
      "Title_Description": "Posting Title...",
      "Description_Description": "Description...",
      "Discard_Alert": "Discard changes?",
      "Discard_Alert_message": "You have unsaved changes. Are you sure to discard them and leave the screen?",
      "Discard_Alert_confirm": "Discard",
      "Discard_Alert_cancel": "Don't leave",
      "Contents": "Contents",
      "Comment": "Comment",
      "Report": "Report",
      "Written_Questions": "Written Questions",
      "Commented_Questions": "Commented Questions",
      "User_Information": "User Information",
      "Settings": "Settings",
      "Account": "Account",
      "Privacy_Security": "Privacy & Security",
      "Themes": "Themes",
      "Languages": "Languages",
      "About": "About",
      "LogOut": "LogOut",
      "System_Mode": "System Mode",
      "System_Mode_Description": "Automatically apply the mode from OS Settings",
      "Dark Mode": "Dark Mode",
      "Light Mode": "Light Mode",
      "Default": "Default",
      "Email": "Correo electrónico",
      "Occupation": "Occupation",
      "Delete_Account": "Delete Account",
      "Lock_Screen": "Lock Screen",
      "Change_the_Password": "Change the Password",
      "Security": "Security",
      "Enter_Password": "Enter Password",
      "Change_Password": "Change Password",
      "App_Version": "App Version",
      "Cancel": "Cancel",
      "OK": "OK",
      "Male": "Male",
      "Female": "Female",
      "Edit_User": "Edit User",
      "Confirm": "Confirm",
      "Upload": "Upload",
      "Delete": "Delete",
      "Report_Question": "Report Question",
      "Report_Question_message": "Do you want to report this question?",
      "Delete_question": "Delete question",
      "Delete_question_message": "Are you sure to delete this question?",
      "Report_Comment": "Report Comment",
      "Report_Comment_message": "Do you want to report this comment?",
      "About_Me": "About Me",
      "Im_From": "I'm From",
      "Im": "I'm",
      "old": "old",
      "Delete_Account_message": "Are you sure delete your account?",
      "Terms_Conditions": "Terms & Conditions\n",
      "Terms_Conditions_message": "These terms and conditions apply to the P4U app (hereby referred to as \"Application\") for mobile devices that was created by Younghoon Yu (hereby referred to as \"Service Provider\") as a Free service.\n\nUpon downloading or utilizing the Application, you are automatically agreeing to the following terms. It is strongly advised that you thoroughly read and understand these terms prior to using the Application. Unauthorized copying, modification of the Application, any part of the Application, or our trademarks is strictly prohibited. Any attempts to extract the source code of the Application, translate the Application into other languages, or create derivative versions are not permitted. All trademarks, copyrights, database rights, and other intellectual property rights related to the Application remain the property of the Service Provider.\n\nThe Service Provider is dedicated to ensuring that the Application is as beneficial and efficient as possible. As such, they reserve the right to modify the Application or charge for their services at any time and for any reason. The Service Provider assures you that any charges for the Application or its services will be clearly communicated to you.\n\nThe Application stores and processes personal data that you have provided to the Service Provider in order to provide the Service. It is your responsibility to maintain the security of your phone and access to the Application. The Service Provider strongly advise against jailbreaking or rooting your phone, which involves removing software restrictions and limitations imposed by the official operating system of your device. Such actions could expose your phone to malware, viruses, malicious programs, compromise your phone's security features, and may result in the Application not functioning correctly or at all.\n\n",
      "Location-Based_Information": "Location-Based Information\n",
      "Location-Based_Information_message": "The Application collects and uses location-based information to enhance user experience and provide location-specific services. This may include approximate or precise location data obtained via GPS, Wi-Fi, or mobile networks. The Service Provider ensures that such data is handled in compliance with privacy regulations and is not shared with unauthorized third parties. Users can disable location services in their device settings if they do not wish to share location data.\n\n",
      "Youth_Protection_Policy": "Youth Protection Policy\n",
      "Youth_Protection_Policy_message": "The Service Provider is committed to ensuring a safe and appropriate experience for users of all ages. If the Application is used by minors, it is recommended that parents or guardians supervise their usage. The Application does not knowingly collect personal information from children under the age of 13 without parental consent. If a parent or guardian discovers that their child has provided personal data without consent, they should contact the Service Provider immediately to remove the information. The Service Provider reserves the right to restrict access to certain features to ensure the safety of young users. Please note that the Application utilizes third-party services that have their own Terms and Conditions. Below are the links to the Terms and Conditions of the third-party service providers used by the Application:\n\n* Google Login Services\n* Apple Login Services\n* AdMob\n\nPlease be aware that the Service Provider does not assume responsibility for certain aspects. Some functions of the Application require an active internet connection, which can be Wi-Fi or provided by your mobile network provider. The Service Provider cannot be held responsible if the Application does not function at full capacity due to lack of access to Wi-Fi or if you have exhausted your data allowance.\n\nIf you are using the application outside of a Wi-Fi area, please be aware that your mobile network provider's agreement terms still apply. Consequently, you may incur charges from your mobile provider for data usage during the connection to the application, or other third-party charges. By using the application, you accept responsibility for any such charges, including roaming data charges if you use the application outside of your home territory (i.e., region or country) without disabling data roaming. If you are not the bill payer for the device on which you are using the application, they assume that you have obtained permission from the bill payer.\n\nSimilarly, the Service Provider cannot always assume responsibility for your usage of the application. For instance, it is your responsibility to ensure that your device remains charged. If your device runs out of battery and you are unable to access the Service, the Service Provider cannot be held responsible.\n\nIn terms of the Service Provider's responsibility for your use of the application, it is important to note that while they strive to ensure that it is updated and accurate at all times, they do rely on third parties to provide information to them so that they can make it available to you. The Service Provider accepts no liability for any loss, direct or indirect, that you experience as a result of relying entirely on this functionality of the application.\n\nThe Service Provider may wish to update the application at some point. The application is currently available as per the requirements for the operating system (and for any additional systems they decide to extend the availability of the application to) may change, and you will need to download the updates if you want to continue using the application. The Service Provider does not guarantee that it will always update the application so that it is relevant to you and/or compatible with the particular operating system version installed on your device. However, you agree to always accept updates to the application when offered to you. The Service Provider may also wish to cease providing the application and may terminate its use at any time without providing termination notice to you. Unless they inform you otherwise, upon any termination, (a) the rights and licenses granted to you in these terms will end; (b) you must cease using the application, and (if necessary) delete it from your device.",
      "Changes_Terms_Conditions": "Changes to These Terms and Conditions",
      "Changes_Terms_Conditions_message": "The Service Provider may periodically update their Terms and Conditions. Therefore, you are advised to review this page regularly for any changes. The Service Provider will notify you of any changes by posting the new Terms and Conditions on this page.\n\nThese terms and conditions are effective as of 2025-02-22\n\n",
      "Contact_us": "Contact Us\n",
      "Contact_us_message": "If you have any questions or suggestions about the Terms and Conditions, please do not hesitate to contact the Service Provider at 0623hoon@gmail.com.\n\n",
      "Delete_Comment": "Delete Comment",
      "Delete_Comment_message": "Do you want to delete this comment?",
      "LogOut_message": "Do you want to logout?",
      "Occupation_Input": "Input your job",
      "New_User": "New User",
      "Edit": "Edit",
      "Post_Alert_message": "Please fill out every options",
      "Social_Login": "Sign In with",
      "All_Term": "Agree All Terms of Use",
      "All_Term_message": "Full consent means consent to all information provided by individual P4U",
      "Gender_Term": "We may collect optional information about your gender, which may include \"Male\", \"Female\", or \"None\".\n\nPurpose of collection:\n- To better understand our user demographics.\n- To improve our services and user experience through analytics.\n- To ensure diversity and inclusion in our design and content decisions.\n\nYour choices:\n- Providing gender information is completely optional.\n- You may choose \"None\" or opt not to provide this data at all.\n- You can request to access, update, or delete your gender information at any time by contacting us.",
      "Country_Term": "We may collect and use information about your location:\n\nWe may collect location data via your device's IP address, Wi-Fi, or other technologies.\n\nTo provide location-based services, enhance user experience, improve our services, and for analytics purposes.\n\nWe do not share your precise location data with third parties without your explicit consent, except as required by law or to provide services you have requested.",
      "Mandatory": "Mandatory",
      "SNS_Term": "Third party consent to personal information",
      "User_Term": "User can report improper question or comment. The user who reported by 3 people will be block account as abuse user.",
      "Age_Term": "Age Data Collection\nWe may collect your age as part of the registration process, and this information is used to tailor content, ads, and other services to better suit your preferences. Specifically, we may collect:\n\nAge Range: For analytics purposes, we may ask for your age or an age range to better understand the demographic composition of our users. This helps us to improve the user experience and deliver content that aligns with your interests.\n\nPersonalized Content and Ads: Based on your age, we may personalize the content and advertisements you see within the app. This ensures that you are presented with relevant information, promotions, and recommendations.\n\nHow We Use Your Age Information\nAnalytics: Your age data may be used in aggregate to generate reports for internal analysis. This helps us improve the app and ensure it meets the needs of all users.\n\nUser Experience: By knowing your age or age group, we can customize app features, content, and ads to provide a more engaging experience tailored to your interests.\n\nData Security:\nWe take the privacy and security of your personal information seriously. Any data, including your age, is stored securely and will not be shared with third parties without your explicit consent, except as required by law.\n\nYour Rights:\nYou have the right to update or delete any personal information you have shared with us, including age data. If you no longer wish to provide this data, you can update your profile settings within the app.",
      "Term_Button": "Agree to continue",
      "See_detail": "See detail",
      "User_Provided_information": "User Provided information",
      "Term_bottom_message": "User also can delete its account. After deletion, all question and comment will be deleted too.",
      "User_logout_message": "User logout",
      "Question_deleted_message": "Question deleted",
      "Comment_deleted_message": "Comment deleted",
      "Account_deleted_message": "Account deleted",
      "Reported_Question_message": "Reported Question",
      "Reported_Comment_message": "Reported Comment",
      "Question_created_message": "Question created",
      "Question_updated_message": "Question updated",
      "Question_created_error_message": "Fail to create question",
      "OAuth2Login_error_message": "No response from Social Login",
      "QAuth2Login_error_login_message": "Fail to login",
      "GetUserDetail_error_message": "Fail to get user info",
      "PostQuestion_error_message": "Fail to create question",
      "UpdateQuestion_error_message": "Fail to update"
    },
    "es": {
      "Forum": "Foro",
      "Post": "Publicación",
      "Profile": "Perfil",
      "Filter": "Filtro",
      "Category": "Categoría",
      "Time": "Hora",
      "Age": "Edad",
      "Country": "País",
      "Gender": "Género",
      "Search": "Buscar",
      "Reset": "Restablecer",
      "Living": "Vida",
      "Career": "Carrera",
      "Food": "Comida",
      "RelationShip": "Relación",
      "none": "ninguno",
      "None": "ninguno",
      "5 min": "5 min",
      "30 min": "30 min",
      "1 hr": "1 hora",
      "1 day": "1 día",
      "Options": "Opciones",
      "Title": "Título",
      "Description": "Descripción",
      "Title_Description": "Título de la publicación...",
      "Description_Description": "Descripción...",
      "Discard_Alert": "¿Descartar cambios?",
      "Discard_Alert_message": "Tiene cambios no guardados. ¿Está seguro de descartarlos y salir?",
      "Discard_Alert_confirm": "Descartar",
      "Discard_Alert_cancel": "Cancelar",
      "Contents": "Contenido",
      "Comment": "Comentario",
      "Report": "Reportar",
      "Written_Questions": "Preguntas escritas",
      "Commented_Questions": "Preguntas comentadas",
      "About_Me": "Sobre mí",
      "User_Information": "Información del usuario",
      "Settings": "Configuración",
      "Account": "Cuenta",
      "Privacy_Security": "Privacidad y seguridad",
      "Themes": "Temas",
      "Languages": "Idiomas",
      "About": "Acerca de",
      "LogOut": "Cerrar sesión",
      "System_Mode": "Modo del sistema",
      "System_Mode_Description": "Aplicar automáticamente el modo desde la configuración del SO",
      "Dark Mode": "Modo oscuro",
      "Light Mode": "Modo claro",
      "Default": "Predeterminado",
      "Email": "Correo electrónico",
      "Occupation": "Ocupación",
      "Delete_Account": "Eliminar cuenta",
      "Lock_Screen": "Bloquear pantalla",
      "Change_the_Password": "Cambiar la contraseña",
      "Security": "Seguridad",
      "Enter_Password": "Introducir contraseña",
      "Change_Password": "Cambiar contraseña",
      "App_Version": "Versión de la aplicación",
      "Cancel": "Cancelar",
      "OK": "Aceptar",
      "Male": "Hombre",
      "Female": "Mujer",
      "Edit_User": "Editar usuario",
      "Confirm": "Confirmar",
      "Upload": "Subir",
      "Delete": "Eliminar",
      "Report_Question": "Reportar pregunta",
      "Report_Question_message": "¿Deseas reportar esta pregunta?",
      "Delete_question": "Eliminar pregunta",
      "Delete_question_message": "¿Estás seguro de que deseas eliminar esta pregunta?",
      "Report_Comment": "Reportar comentario",
      "Report_Comment_message": "¿Deseas reportar este comentario?",
      "Im_From": "Soy de",
      "Im": "Tengo",
      "old": "años",
      "Delete_Account_message": "¿Estás seguro de que deseas eliminar tu cuenta?",
      "Terms_Conditions": "Términos y condiciones\n",
      "Terms_Conditions_message": "Estos términos y condiciones se aplican a la aplicación P4U (en adelante, la \"Aplicación\") para dispositivos móviles, creada por Younghoon Yu (en adelante, el \"Proveedor del servicio\"), como un servicio gratuito. Al usar esta aplicación, usted acepta cumplir con estos términos. Si no está de acuerdo con alguna parte de los términos, no debe utilizar la Aplicación.\n\n",
      "Location-Based_Information": "Información basada en la ubicación\n",
      "Location-Based_Information_message": "La Aplicación recopila y utiliza información basada en la ubicación para mejorar la experiencia del usuario y proporcionar servicios personalizados según la ubicación. La recopilación y el uso de esta información están sujetos a la política de privacidad de la Aplicación. El usuario puede activar o desactivar los servicios de ubicación en la configuración del dispositivo.\n\n",
      "Youth_Protection_Policy": "Política de protección juvenil\n",
      "Youth_Protection_Policy_message": "El Proveedor del servicio se compromete a garantizar una experiencia segura y adecuada para los usuarios de todas las edades. Se implementan medidas para prevenir la exposición a contenido inapropiado, y se anima a los usuarios a reportar cualquier comportamiento sospechoso o perjudicial. Los datos personales de los menores se manejan con especial cuidado y en cumplimiento con las leyes aplicables de protección infantil.\n\n",
      "Changes_Terms_Conditions": "Cambios en los términos y condiciones\n",
      "Changes_Terms_Conditions_message": "El Proveedor del servicio puede actualizar periódicamente sus Términos y condiciones. Por lo tanto, se recomienda revisar esta página regularmente. Se notificará a los usuarios sobre cualquier cambio publicando los nuevos términos en esta página. Los cambios entrarán en vigencia inmediatamente después de su publicación.\n\n",
      "Contact_us": "Contáctanos\n",
      "Contact_us_message": "Si tienes preguntas o sugerencias sobre los Términos y condiciones, no dudes en contactar al Proveedor del servicio en 0623hoon@gmail.com.\n\n",
      "Delete_Comment": "Eliminar comentario",
      "Delete_Comment_message": "¿Deseas eliminar este comentario?",
      "LogOut_message": "¿Deseas cerrar sesión?",
      "Occupation_Input": "Introduce tu profesión",
      "New_User": "Usuario nuevo",
      "Edit": "Editar",
      "Post_Alert_message": "Por favor, completa todas las opciones",
      "Social_Login": "Iniciar sesión con redes sociales",
      "All_Term": "Aceptar todos los términos de uso",
      "All_Term_message": "El consentimiento total significa aceptar toda la información proporcionada individualmente por P4U.",
      "Gender_Term": "Podemos recopilar información opcional sobre su género, que puede incluir \"Masculino\", \"Femenino\" o \"Ninguno\".\n\nPropósito de la recopilación:\n- Comprender mejor la demografía de nuestros usuarios.\n- Mejorar nuestros servicios y experiencia de usuario mediante análisis.\n- Garantizar la diversidad e inclusión en nuestras decisiones de diseño y contenido.\n\nSus opciones:\n- Proporcionar información de género es completamente opcional.\n- Puede elegir \"Ninguno\" o no proporcionar esta información.\n- Puede solicitar acceder, actualizar o eliminar su información de género en cualquier momento poniéndose en contacto con nosotros.",
      "Country_Term": "Podemos recopilar y usar información sobre su ubicación:\n\nPodemos recopilar datos de ubicación mediante la dirección IP de su dispositivo, Wi-Fi u otras tecnologías.\n\nPara proporcionar servicios basados en ubicación, mejorar la experiencia del usuario, mejorar nuestros servicios y con fines analíticos.\n\nNo compartimos su ubicación precisa con terceros sin su consentimiento explícito, salvo que lo exija la ley o para proporcionar los servicios solicitados.",
      "Mandatory": "Obligatorio",
      "SNS_Term": "Consentimiento de terceros para información personal",
      "User_Term": "El usuario puede reportar preguntas o comentarios inapropiados. El usuario que sea reportado por 3 personas será bloqueado como usuario abusivo.",
      "Age_Term": "Recopilación de datos de edad\nPodemos recopilar su edad como parte del proceso de registro, y esta información se utiliza para personalizar contenido, anuncios y otros servicios de acuerdo con sus preferencias. Específicamente, podemos recopilar:\n\nRango de edad: Para fines analíticos, podemos pedir su edad o un rango de edad para entender mejor la composición demográfica de nuestros usuarios. Esto nos ayuda a mejorar la experiencia del usuario y ofrecer contenido relevante.\n\nContenido y anuncios personalizados: Según su edad, podemos personalizar el contenido y los anuncios que ve en la aplicación. Esto garantiza que reciba información, promociones y recomendaciones relevantes.\n\nCómo usamos su información de edad\nAnálisis: Sus datos de edad pueden usarse en forma agregada para generar informes de análisis interno. Esto nos ayuda a mejorar la aplicación y satisfacer mejor las necesidades de todos los usuarios.\n\nExperiencia de usuario: Al conocer su edad o grupo de edad, podemos personalizar las funciones de la aplicación, el contenido y los anuncios para proporcionar una experiencia más atractiva.\n\nSeguridad de los datos:\nNos tomamos en serio la privacidad y seguridad de su información personal. Todos los datos, incluida su edad, se almacenan de forma segura y no se compartirán con terceros sin su consentimiento explícito, salvo que lo exija la ley.\n\nSus derechos:\nTiene derecho a actualizar o eliminar cualquier información personal que haya compartido con nosotros, incluida la información de edad. Si ya no desea proporcionar esta información, puede actualizar la configuración de su perfil en la aplicación.",
      "Term_Button": "Aceptar para continuar",
      "See_detail": "Ver detalles",
      "User_Provided_information": "Información proporcionada por el usuario",
      "Term_bottom_message": "El usuario también puede eliminar su cuenta. Después de eliminarla, se eliminarán todas las preguntas y comentarios.",
      "User_logout_message": "Cierre de sesión del usuario",
      "Question_deleted_message": "Pregunta eliminada",
      "Comment_deleted_message": "Comentario eliminado",
      "Account_deleted_message": "Cuenta eliminada",
      "Reported_Question_message": "Pregunta reportada",
      "Reported_Comment_message": "Comentario reportado",
      "Question_created_message": "Pregunta creada",
      "Question_updated_message": "Pregunta actualizada",
      "Question_created_error_message": "Error al crear la pregunta",
      "OAuth2Login_error_message": "Sin respuesta del inicio de sesión social",
      "QAuth2Login_error_login_message": "Error al iniciar sesión",
      "GetUserDetail_error_message": "Error al obtener la información del usuario",
      "PostQuestion_error_message": "Error al crear la pregunta",
      "UpdateQuestion_error_message": "Error al actualizar la pregunta"
    },
    "ja": {
      "Forum": "フォーラム",
      "Post": "投稿",
      "Profile": "プロフィール",
      "Filter": "フィルター",
      "Category": "カテゴリ",
      "Time": "時間",
      "Age": "年齢",
      "Country": "国",
      "Gender": "性別",
      "Search": "検索",
      "Reset": "リセット",
      "Living": "生活",
      "Career": "キャリア",
      "Food": "食べ物",
      "RelationShip": "関係",
      "none": "なし",
      "None": "なし",
      "5 min": "5分",
      "30 min": "30分",
      "1 hr": "1時間",
      "1 day": "1日",
      "Options": "オプション",
      "Title": "タイトル",
      "Description": "説明",
      "Title_Description": "投稿タイトル...",
      "Description_Description": "説明...",
      "Discard_Alert": "変更を破棄しますか？",
      "Discard_Alert_message": "保存されていない変更があります。変更を破棄して画面を離れてもよろしいですか？",
      "Discard_Alert_confirm": "破棄",
      "Discard_Alert_cancel": "離れない",
      "Contents": "内容",
      "Comment": "コメント",
      "Report": "報告",
      "Written_Questions": "書いた質問",
      "Commented_Questions": "コメントした質問",
      "About_Me": "自己紹介",
      "User_Information": "ユーザー情報",
      "Settings": "設定",
      "Account": "アカウント",
      "Privacy_Security": "プライバシーとセキュリティ",
      "Themes": "テーマ",
      "Languages": "言語",
      "About": "アバウト",
      "LogOut": "ログアウト",
      "System_Mode": "システムモード",
      "System_Mode_Description": "OSの設定から自動的にモードを適用",
      "Dark Mode": "ダークモード",
      "Light Mode": "ライトモード",
      "Default": "デフォルト",
      "Email": "メールアドレス",
      "Occupation": "職業",
      "Delete_Account": "アカウントを削除",
      "Lock_Screen": "画面をロック",
      "Change_the_Password": "パスワードを変更",
      "Security": "セキュリティ",
      "Enter_Password": "パスワードを入力",
      "Change_Password": "パスワードを変更",
      "App_Version": "アプリのバージョン",
      "Cancel": "キャンセル",
      "OK": "OK",
      "Male": "男性",
      "Female": "女性",
      "Edit_User": "ユーザーを編集",
      "Confirm": "確認",
      "Upload": "アップロード",
      "Delete": "削除",
      "Report_Question": "質問を報告",
      "Report_Question_message": "この質問を報告しますか？",
      "Delete_question": "質問を削除",
      "Delete_question_message": "この質問を削除してもよろしいですか？",
      "Report_Comment": "コメントを報告",
      "Report_Comment_message": "このコメントを報告しますか？",
      "Im_From": "出身地",
      "Im": "私は",
      "old": "歳",
      "Delete_Account_message": "アカウントを削除してもよろしいですか？",
      "Terms_Conditions": "利用規約\n",
      "Terms_Conditions_message": "これらの利用規約は、Younghoon Yu（以下「サービス提供者」といいます）が無料サービスとして作成したモバイルデバイス用のP4Uアプリ（以下「アプリケーション」といいます）に適用されます。\n\nアプリケーションをダウンロードまたは利用することにより、以下の規約に自動的に同意したことになります。アプリケーションを使用する前に、これらの規約を十分に読み、理解することを強くお勧めします。アプリケーション、アプリケーションの一部、または当社の商標の無断コピー、改変は禁止されています。アプリケーションのソースコードを抽出したり、他の言語に翻訳したり、派生バージョンを作成したりする試みは許可されていません。アプリケーションに関連するすべての商標、著作権、データベース権、およびその他の知的財産権は、サービス提供者の所有物です。\n\nサービス提供者は、アプリケーションが可能な限り有益で効率的であることを保証することに尽力しています。そのため、サービス提供者は、いつでも理由を問わず、アプリケーションを変更したり、サービスに対して料金を請求したりする権利を留保します。サービス提供者は、アプリケーションまたはそのサービスに対する料金が明確に通知されることを保証します。\n\nアプリケーションは、サービスを提供するために、サービス提供者に提供された個人データを保存および処理します。携帯電話およびアプリケーションへのアクセスのセキュリティを維持する責任はユーザーにあります。サービス提供者は、携帯電話のジェイルブレイクやルート化（公式オペレーティングシステムによって課されたソフトウェア制限や制限を削除すること）を強くお勧めしません。これらの行為は、マルウェア、ウイルス、悪意のあるプログラムに携帯電話をさらし、携帯電話のセキュリティ機能を損なう可能性があり、アプリケーションが正しく機能しなくなる可能性があります。\n\n",
      "Location-Based_Information": "位置情報に基づく情報\n",
      "Location-Based_Information_message": "アプリケーションは、ユーザーエクスペリエンスを向上させ、位置特定サービスを提供するために、位置情報に基づく情報を収集および使用します。これには、GPS、Wi-Fi、またはモバイルネットワークを介して取得されたおおよそまたは正確な位置データが含まれる場合があります。サービス提供者は、そのようなデータがプライバシー規制に準拠して取り扱われ、許可されていない第三者と共有されないことを保証します。ユーザーは、位置データを共有したくない場合、デバイスの設定で位置情報サービスを無効にすることができます。\n\n",
      "Youth_Protection_Policy": "青少年保護方針\n",
      "Youth_Protection_Policy_message": "サービス提供者は、すべての年齢のユーザーにとって安全で適切な体験を確保することに尽力しています。アプリケーションが未成年者によって使用される場合、保護者または監督者がその使用を監督することをお勧めします。アプリケーションは、保護者の同意なしに13歳未満の子供から個人情報を意図的に収集することはありません。保護者または監督者が、子供が同意なしに個人データを提供したことを発見した場合、サービス提供者に直ちに連絡して情報を削除する必要があります。サービス提供者は、若いユーザーの安全を確保するために、特定の機能へのアクセスを制限する権利を留保します。アプリケーションは、独自の利用規約を持つ第三者サービスを利用していることに注意してください。以下は、アプリケーションで使用されている第三者サービスプロバイダーの利用規約へのリンクです：\n\n* Googleログインサービス\n* Appleログインサービス\n* AdMob\n\nサービス提供者は、特定の側面について責任を負わないことをご了承ください。アプリケーションの一部の機能は、Wi-Fiまたはモバイルネットワークプロバイダーによって提供されるアクティブなインターネット接続を必要とします。Wi-Fiへのアクセスがない場合やデータ許容量を使い果たした場合、アプリケーションが完全に機能しないことについて、サービス提供者は責任を負いません。\n\nWi-Fiエリア外でアプリケーションを使用する場合、モバイルネットワークプロバイダーの契約条件が引き続き適用されることに注意してください。その結果、アプリケーションへの接続中のデータ使用に対して、モバイルプロバイダーから料金が発生する可能性があります。アプリケーションを使用することにより、そのような料金、特に自宅の地域（つまり、地域または国）外でアプリケーションを使用する場合のローミングデータ料金を含め、すべての料金に対して責任を負うことに同意したことになります。アプリケーションを使用しているデバイスの請求者でない場合、請求者から許可を得ていると見なされます。\n\n同様に、サービス提供者は、アプリケーションの使用に関して常に責任を負うことはできません。たとえば、デバイスの充電を維持する責任はユーザーにあります。デバイスのバッテリーが切れてサービスにアクセスできなくなった場合、サービス提供者は責任を負いません。\n\nアプリケーションの使用に関するサービス提供者の責任については、常に最新で正確であることを保証するよう努めていますが、第三者から情報を提供してもらい、それをユーザーに提供しているため、完全に依存することによって発生する損失について、サービス提供者は責任を負いません。\n\nサービス提供者は、将来的にアプリケーションを更新することを希望する場合があります。アプリケーションは現在、オペレーティングシステムの要件に基づいて利用可能ですが（およびアプリケーションの可用性を拡張することを決定した追加のシステムについても）、要件が変更される可能性があり、アプリケーションを引き続き使用するには、更新をダウンロードする必要があります。サービス提供者は、アプリケーションが常にユーザーに関連し、デバイスにインストールされている特定のオペレーティングシステムバージョンと互換性があることを保証するものではありません。ただし、提供された場合は常にアプリケーションの更新を受け入れることに同意するものとします。サービス提供者は、アプリケーションの提供を中止し、通知なしにその使用を終了することを希望する場合があります。別途通知がない限り、終了時には、(a) これらの規約で付与された権利およびライセンスは終了し、(b) アプリケーションの使用を中止し、必要に応じてデバイスから削除する必要があります。\n\n",
      "Changes_Terms_Conditions": "利用規約の変更\n",
      "Changes_Terms_Conditions_message": "サービス提供者は、定期的に利用規約を更新することがあります。したがって、変更がないか定期的にこのページを確認することをお勧めします。サービス提供者は、新しい利用規約をこのページに掲載することで、変更を通知します。\n\nこれらの利用規約は、2025年2月22日より有効です。\n\n",
      "Contact_us": "お問い合わせ\n",
      "Contact_us_message": "利用規約に関するご質問やご提案がございましたら、0623hoon@gmail.com までお気軽にお問い合わせください。\n\n",
      "Delete_Comment": "コメントを削除",
      "Delete_Comment_message": "このコメントを削除しますか？",
      "LogOut_message": "ログアウトしますか？",
      "Occupation_Input": "職業を入力してください",
      "New_User": "新規ユーザー",
      "Edit": "編集",
      "Post_Alert_message": "すべての項目を入力してください",
      "Social_Login": "ソーシャルでログイン",
      "All_Term": "すべての利用規約に同意する",
      "All_Term_message": "すべてに同意することで、P4Uが個別に提供するすべての情報に同意したことになります。",
      "Gender_Term": "「男性」「女性」「なし」を含む性別に関する任意の情報を収集する場合があります。\n\n収集目的：\n- ユーザーの人口統計を理解するため\n- サービスとユーザー体験の向上のため\n- デザインやコンテンツにおける多様性と包括性の実現のため\n\n選択肢：\n- 性別情報の提供は任意です。\n- 「なし」を選択、または提供しないことも可能です。\n- ご希望であればいつでも性別情報へのアクセス、更新、削除が可能です。",
      "Country_Term": "お客様の位置情報を収集・使用する場合があります：\n\nIPアドレス、Wi-Fi、その他の技術を通じて位置データを収集することがあります。\n\n位置に基づいたサービスの提供、ユーザー体験の向上、分析目的などに使用します。\n\n法律上またはお客様が要求したサービスの提供を除き、明示的な同意なしに第三者と正確な位置情報を共有することはありません。",
      "Mandatory": "必須",
      "SNS_Term": "第三者への個人情報提供に関する同意",
      "User_Term": "不適切な質問やコメントをユーザーが通報できます。3人以上から通報されたユーザーはアカウントがブロックされます。",
      "Age_Term": "年齢情報の収集\n登録時に年齢情報を収集する場合があり、この情報はコンテンツ、広告、サービスのパーソナライズに使用されます。\n\n収集内容：\n- 分析目的で年齢または年齢範囲を求めることがあります。\n\n個別対応：\n- 年齢に基づいてアプリ内の表示内容や広告を最適化します。\n\n利用目的：\n- 内部分析のためのレポート作成\n- より適したユーザー体験の提供\n\nデータの安全性：\n- すべての情報は安全に保管され、法令に基づく場合を除き、同意なく第三者に提供されることはありません。\n\n権利：\n- 年齢情報を含むすべての個人情報は、いつでも更新または削除が可能です。",
      "Term_Button": "同意して続ける",
      "See_detail": "詳細を見る",
      "User_Provided_information": "ユーザーが提供した情報",
      "Term_bottom_message": "ユーザーはアカウントを削除することができます。削除後、すべての質問とコメントは削除されます。",
      "User_logout_message": "ユーザーログアウト",
      "Question_deleted_message": "質問が削除されました",
      "Comment_deleted_message": "コメントが削除されました",
      "Account_deleted_message": "アカウントが削除されました",
      "Reported_Question_message": "報告された質問",
      "Reported_Comment_message": "報告されたコメント",
      "Question_created_message": "質問が作成されました",
      "Question_updated_message": "質問が更新されました",
      "Question_created_error_message": "質問の作成に失敗しました",
      "OAuth2Login_error_message": "ソーシャルログインからの応答がありません",
      "QAuth2Login_error_login_message": "ログインに失敗しました",
      "GetUserDetail_error_message": "ユーザー情報の取得に失敗しました",
      "PostQuestion_error_message": "質問の作成に失敗しました",
      "UpdateQuestion_error_message": "質問の更新に失敗しました"
    },
    "zh": {
      "Forum": "论坛",
      "Post": "帖子",
      "Profile": "个人资料",
      "Filter": "筛选",
      "Category": "分类",
      "Time": "时间",
      "Age": "年龄",
      "Country": "国家",
      "Gender": "性别",
      "Search": "搜索",
      "Reset": "重置",
      "Living": "生活",
      "Career": "职业",
      "Food": "食物",
      "RelationShip": "关系",
      "none": "无",
      "None": "无",
      "5 min": "5分钟",
      "30 min": "30分钟",
      "1 hr": "1小时",
      "1 day": "1天",
      "Options": "选项",
      "Title": "标题",
      "Description": "描述",
      "Title_Description": "帖子标题...",
      "Description_Description": "描述...",
      "Discard_Alert": "放弃更改？",
      "Discard_Alert_message": "您有未保存的更改。确定要放弃并离开吗？",
      "Discard_Alert_confirm": "放弃",
      "Discard_Alert_cancel": "不离开",
      "Contents": "内容",
      "Comment": "评论",
      "Report": "举报",
      "Written_Questions": "已写问题",
      "Commented_Questions": "评论过的问题",
      "About_Me": "关于我",
      "User_Information": "用户信息",
      "Settings": "设置",
      "Account": "账户",
      "Privacy_Security": "隐私与安全",
      "Themes": "主题",
      "Languages": "语言",
      "About": "关于",
      "LogOut": "登出",
      "System_Mode": "系统模式",
      "System_Mode_Description": "自动应用操作系统的模式设置",
      "Dark Mode": "深色模式",
      "Light Mode": "浅色模式",
      "Default": "默认",
      "Email": "电子邮件",
      "Occupation": "职业",
      "Delete_Account": "删除账户",
      "Lock_Screen": "锁定屏幕",
      "Change_the_Password": "更改密码",
      "Security": "安全",
      "Enter_Password": "输入密码",
      "Change_Password": "更改密码",
      "App_Version": "应用版本",
      "Cancel": "取消",
      "OK": "确定",
      "Male": "男性",
      "Female": "女性",
      "Edit_User": "编辑用户",
      "Confirm": "确认",
      "Upload": "上传",
      "Delete": "删除",
      "Report_Question": "举报问题",
      "Report_Question_message": "您想举报此问题吗？",
      "Delete_question": "删除问题",
      "Delete_question_message": "您确定要删除此问题吗？",
      "Report_Comment": "举报评论",
      "Report_Comment_message": "您想举报此评论吗？",
      "Im_From": "我来自",
      "Im": "我是",
      "old": "岁",
      "Delete_Account_message": "您确定要删除您的账户吗？",
      "Terms_Conditions": "条款和条件\n",
      "Terms_Conditions_message": "这些条款和条件适用于由Younghoon Yu（以下简称“服务提供商”）创建的P4U应用程序（以下简称“应用程序”），作为一项免费服务。\n\n下载或使用本应用程序即表示您自动同意以下条款。强烈建议您在使用本应用程序之前仔细阅读并理解这些条款。未经授权，严禁复制、修改本应用程序或其任何部分，或使用我们的商标。严禁试图提取本应用程序的源代码、将其翻译成其他语言或创建衍生版本。与本应用程序相关的所有商标、版权、数据库权利和其他知识产权仍归服务提供商所有。\n\n服务提供商致力于确保本应用程序尽可能有益和高效。因此，他们保留随时出于任何原因修改本应用程序或收取服务费用的权利。服务提供商向您保证，任何关于本应用程序或其服务的费用将明确告知您。\n\n本应用程序存储和处理您提供给服务提供商的个人数据，以提供服务。您有责任维护手机的安全性和对本应用程序的访问。服务提供商强烈建议不要越狱或获取root权限，这涉及移除设备官方操作系统施加的软件限制和限制。此类行为可能使您的手机暴露于恶意软件、病毒、恶意程序，破坏手机的安全功能，并可能导致本应用程序无法正常运行或完全无法运行。\n\n",
      "Location-Based_Information": "基于位置的信息\n",
      "Location-Based_Information_message": "本应用程序收集和使用基于位置的信息，以增强用户体验并提供特定位置的服务。这可能包括通过GPS、Wi-Fi或移动网络获得的大致或精确位置数据。服务提供商确保此类数据的处理符合隐私法规，并且不会与未经授权的第三方共享。如果用户不希望共享位置信息，可以在设备设置中禁用位置服务。\n\n",
      "Youth_Protection_Policy": "青少年保护政策\n",
      "Youth_Protection_Policy_message": "服务提供商致力于为所有年龄段的用户提供安全和适当的体验。如果未成年人使用本应用程序，建议家长或监护人监督其使用情况。本应用程序不会在未经父母同意的情况下，故意收集13岁以下儿童的个人信息。如果家长或监护人发现其子女在未经同意的情况下提供了个人数据，应立即联系服务提供商以删除该信息。服务提供商保留限制访问某些功能的权利，以确保年轻用户的安全。请注意，本应用程序使用了具有自己条款和条件的第三方服务。以下是本应用程序使用的第三方服务提供商的条款和条件链接：\n\n* Google登录服务\n* Apple登录服务\n* AdMob\n\n请注意，服务提供商不对某些方面承担责任。本应用程序的某些功能需要活跃的互联网连接，这可以是Wi-Fi或由您的移动网络提供商提供。如果由于无法访问Wi-Fi或您已用尽数据配额，导致本应用程序无法充分运行，服务提供商不承担责任。\n\n如果您在非Wi-Fi区域使用本应用程序，请注意您的移动网络提供商的协议条款仍然适用。因此，您可能会因在连接本应用程序期间的数据使用而从移动提供商处产生费用，或产生其他第三方费用。通过使用本应用程序，您接受对此类费用的责任，包括如果您在本地（即地区或国家）以外使用本应用程序而未禁用数据漫游时产生的漫游数据费用。如果您不是使用本应用程序的设备的账单付款人，他们假定您已获得账单付款人的许可。\n\n同样，服务提供商不能始终对您使用本应用程序的情况承担责任。例如，确保您的设备保持充电是您的责任。如果您的设备电量耗尽，您无法访问服务，服务提供商不承担责任。\n\n关于服务提供商对您使用本应用程序的责任，重要的是要注意，虽然他们努力确保本应用程序始终更新和准确，但他们依赖第三方向他们提供信息，以便他们可以将其提供给您。服务提供商对您完全依赖本应用程序的功能而导致的任何直接或间接损失不承担任何责任。\n\n服务提供商可能希望在某个时候更新本应用程序。目前，本应用程序可用于满足操作系统的要求（以及他们决定扩展本应用程序可用性的任何其他系统），可能会发生变化，如果您希望继续使用本应用程序，您需要下载更新。服务提供商不保证始终更新本应用程序，以使其与您相关和/或与您设备上安装的特定操作系统版本兼容。然而，您同意在提供更新时始终接受本应用程序的更新。服务提供商也可能希望停止提供本应用程序，并可能在不向您提供终止通知的情况下终止其使用。除非他们另行通知您，否则在任何终止后，（a）根据这些条款授予您的权利和许可将终止；（b）您必须停止使用本应用程序，并（如有必要）从您的设备中删除它。\n\n",
      "Changes_Terms_Conditions": "条款和条件的更改\n",
      "Changes_Terms_Conditions_message": "服务提供商可能会定期更新其条款和条件。因此，建议您定期查看此页面以了解任何更改。服务提供商将在此页面上发布新的条款和条件，以通知您任何更改。\n\n这些条款和条件自2025年2月22日起生效。\n\n",
      "Contact_us": "联系我们\n",
      "Contact_us_message": "如果您对条款和条件有任何疑问或建议，请随时通过0623hoon@gmail.com联系服务提供商。\n\n",
      "Delete_Comment": "删除评论",
      "Delete_Comment_message": "您确定要删除此评论吗？",
      "LogOut_message": "您确定要退出登录吗？",
      "Occupation_Input": "请输入您的职业",
      "New_User": "新用户",
      "Edit": "编辑",
      "Post_Alert_message": "请填写所有选项",
      "Social_Login": "使用社交账号登录",
      "All_Term": "同意所有使用条款",
      "All_Term_message": "完全同意意味着您同意 P4U 提供的所有信息。",
      "Gender_Term": "我们可能会收集关于您性别的可选信息，包括“男性”、“女性”或“无”。\n\n收集目的：\n- 更好地了解用户群体。\n- 通过分析改善我们的服务和用户体验。\n- 确保设计和内容决策的多样性和包容性。\n\n您的选择：\n- 提供性别信息是完全自愿的。\n- 您可以选择“不提供”或“无”。\n- 您可以随时联系我们以访问、更新或删除您的性别信息。",
      "Country_Term": "我们可能会收集并使用您的位置信息：\n\n我们可能通过设备的 IP 地址、Wi-Fi 或其他技术收集位置数据。\n\n用于提供基于位置的服务、提升用户体验、优化服务和进行分析。\n\n除非法律要求或为您请求的服务所需，我们不会在未经您明确同意的情况下向第三方共享您的精确位置数据。",
      "Mandatory": "必填",
      "SNS_Term": "第三方个人信息同意",
      "User_Term": "用户可以举报不当的问题或评论。若一名用户被三人举报，将被视为滥用用户并封号。",
      "Age_Term": "年龄数据收集\n我们可能在注册过程中收集您的年龄信息，用于根据您的喜好定制内容、广告和服务。\n\n收集内容：\n- 为分析目的，可能要求您提供年龄或年龄范围，以更好了解用户构成。\n\n个性化内容和广告：\n- 根据您的年龄展示更相关的信息、促销和推荐内容。\n\n用途：\n- 聚合形式用于内部分析报告\n- 个性化功能和广告提供更合适的用户体验\n\n数据安全性：\n- 您的所有信息都将安全存储，除非法律要求，未经您同意不会共享给第三方。\n\n您的权利：\n- 您可随时更新或删除包括年龄在内的个人信息。",
      "Term_Button": "同意并继续",
      "See_detail": "查看详情",
      "User_Provided_information": "用户提供的信息",
      "Term_bottom_message": "用户也可以删除其账户。删除后，所有问题和评论也将被删除。",
      "User_logout_message": "用户已注销",
      "Question_deleted_message": "问题已删除",
      "Comment_deleted_message": "评论已删除",
      "Account_deleted_message": "账户已删除",
      "Reported_Question_message": "被举报的问题",
      "Reported_Comment_message": "被举报的评论",
      "Question_created_message": "问题已创建",
      "Question_updated_message": "问题已更新",
      "Question_created_error_message": "创建问题失败",
      "OAuth2Login_error_message": "社交登录无响应",
      "QAuth2Login_error_login_message": "登录失败",
      "GetUserDetail_error_message": "获取用户信息失败",
      "PostQuestion_error_message": "创建问题失败",
      "UpdateQuestion_error_message": "更新问题失败"
    },
    "vn": {
      "Forum": "Diễn đàn",
      "Post": "Bài viết",
      "Profile": "Hồ sơ",
      "Filter": "Bộ lọc",
      "Category": "Danh mục",
      "Time": "Thời gian",
      "Age": "Tuổi",
      "Country": "Quốc gia",
      "Gender": "Giới tính",
      "Search": "Tìm kiếm",
      "Reset": "Đặt lại",
      "Living": "Cuộc sống",
      "Career": "Nghề nghiệp",
      "Food": "Thức ăn",
      "RelationShip": "Mối quan hệ",
      "none": "không có",
      "None": "không có",
      "5 min": "5 phút",
      "30 min": "30 phút",
      "1 hr": "1 giờ",
      "1 day": "1 ngày",
      "Options": "Tùy chọn",
      "Title": "Tiêu đề",
      "Description": "Mô tả",
      "Title_Description": "Tiêu đề bài viết...",
      "Description_Description": "Mô tả...",
      "Discard_Alert": "Hủy bỏ thay đổi?",
      "Discard_Alert_message": "Bạn có thay đổi chưa lưu. Bạn có chắc muốn hủy bỏ và thoát không?",
      "Discard_Alert_confirm": "Hủy bỏ",
      "Discard_Alert_cancel": "Không thoát",
      "Contents": "Nội dung",
      "Comment": "Bình luận",
      "Report": "Báo cáo",
      "Written_Questions": "Câu hỏi đã viết",
      "Commented_Questions": "Câu hỏi đã bình luận",
      "About_Me": "Về tôi",
      "User_Information": "Thông tin người dùng",
      "Settings": "Cài đặt",
      "Account": "Tài khoản",
      "Privacy_Security": "Riêng tư & Bảo mật",
      "Themes": "Giao diện",
      "Languages": "Ngôn ngữ",
      "About": "Giới thiệu",
      "LogOut": "Đăng xuất",
      "System_Mode": "Chế độ hệ thống",
      "System_Mode_Description": "Tự động áp dụng chế độ từ cài đặt hệ điều hành",
      "Dark Mode": "Chế độ tối",
      "Light Mode": "Chế độ sáng",
      "Default": "Mặc định",
      "Email": "Email",
      "Occupation": "Nghề nghiệp",
      "Delete_Account": "Xóa tài khoản",
      "Lock_Screen": "Khóa màn hình",
      "Change_the_Password": "Đổi mật khẩu",
      "Security": "Bảo mật",
      "Enter_Password": "Nhập mật khẩu",
      "Change_Password": "Đổi mật khẩu",
      "App_Version": "Phiên bản ứng dụng",
      "Cancel": "Hủy",
      "OK": "OK",
      "Male": "Nam",
      "Female": "Nữ",
      "Edit_User": "Chỉnh sửa người dùng",
      "Confirm": "Xác nhận",
      "Upload": "Tải lên",
      "Delete": "Xóa",
      "Report_Question": "Báo cáo câu hỏi",
      "Report_Question_message": "Bạn có muốn báo cáo câu hỏi này không?",
      "Delete_question": "Xóa câu hỏi",
      "Delete_question_message": "Bạn có chắc chắn muốn xóa câu hỏi này không?",
      "Report_Comment": "Báo cáo bình luận",
      "Report_Comment_message": "Bạn có muốn báo cáo bình luận này không?",
      "Im_From": "Tôi đến từ",
      "Im": "Tôi là",
      "old": "tuổi",
      "Delete_Account_message": "Bạn có chắc chắn muốn xóa tài khoản của mình không?",
      "Terms_Conditions": "Điều khoản & Điều kiện\n",
      "Terms_Conditions_message": "Các điều khoản và điều kiện này áp dụng cho ứng dụng P4U (sau đây gọi là \"Ứng dụng\") được tạo bởi Younghoon Yu (sau đây gọi là \"Nhà phát triển\") như một dịch vụ miễn phí.\n\nKhi tải xuống hoặc sử dụng Ứng dụng, bạn được coi là đã chấp nhận các điều khoản này. Vui lòng đọc kỹ trước khi sử dụng. Bạn không được phép sao chép hoặc sửa đổi Ứng dụng, bất kỳ phần nào của Ứng dụng hoặc các nhãn hiệu của chúng tôi. Bạn cũng không được cố gắng trích xuất mã nguồn của Ứng dụng, dịch ứng dụng sang ngôn ngữ khác hoặc tạo phiên bản phái sinh. Mọi quyền liên quan đến thương hiệu, bản quyền, cơ sở dữ liệu và quyền sở hữu trí tuệ khác vẫn thuộc về Nhà phát triển.\n\nNhà phát triển cam kết cung cấp ứng dụng hữu ích và hiệu quả nhất có thể, và vì lý do đó, có thể thay đổi hoặc tính phí cho các dịch vụ vào bất kỳ lúc nào. Bất kỳ khoản phí nào sẽ được thông báo rõ ràng.\n\nỨng dụng lưu trữ và xử lý dữ liệu cá nhân bạn cung cấp để cung cấp dịch vụ. Bạn có trách nhiệm đảm bảo an toàn cho thiết bị và truy cập ứng dụng. Không nên jailbreak hoặc root thiết bị vì điều này có thể gây ra rủi ro bảo mật và làm ứng dụng hoạt động không bình thường.\n\n",
      "Location-Based_Information": "Thông tin dựa trên vị trí\n",
      "Location-Based_Information_message": "Ứng dụng thu thập và sử dụng dữ liệu vị trí để cải thiện trải nghiệm người dùng và cung cấp dịch vụ phù hợp theo khu vực. Dữ liệu có thể bao gồm vị trí tương đối hoặc chính xác thông qua GPS, Wi-Fi hoặc mạng di động. Nhà phát triển cam kết bảo vệ quyền riêng tư và không chia sẻ dữ liệu này với bên thứ ba không được phép. Bạn có thể tắt chia sẻ vị trí trong cài đặt thiết bị.\n\n",
      "Youth_Protection_Policy": "Chính sách bảo vệ thanh thiếu niên\n",
      "Youth_Protection_Policy_message": "Nhà phát triển cam kết tạo môi trường an toàn cho người dùng ở mọi lứa tuổi. Nếu trẻ vị thành niên sử dụng ứng dụng, cha mẹ hoặc người giám hộ nên giám sát. Ứng dụng không cố ý thu thập dữ liệu cá nhân của trẻ em dưới 13 tuổi mà không có sự đồng ý của cha mẹ. Nếu phát hiện dữ liệu đã được thu thập, vui lòng liên hệ để xóa bỏ. Nhà phát triển có thể hạn chế quyền truy cập vào một số chức năng nhằm đảm bảo an toàn cho người dùng nhỏ tuổi. \n\nỨng dụng sử dụng các dịch vụ bên thứ ba có điều khoản riêng:\n* Google Sign-In\n* Apple Sign-In\n* AdMob\n\nXin lưu ý rằng một số tính năng yêu cầu kết nối Internet, thông qua Wi-Fi hoặc dữ liệu di động. Nhà phát triển không chịu trách nhiệm nếu ứng dụng không hoạt động do mất kết nối hoặc vượt quá dung lượng dữ liệu.\n\nNếu bạn sử dụng ứng dụng ngoài khu vực Wi-Fi, có thể phát sinh phí dữ liệu từ nhà cung cấp dịch vụ của bạn. Bằng cách sử dụng ứng dụng, bạn chấp nhận các chi phí đó. Nếu bạn không phải là người thanh toán hóa đơn cho thiết bị, hãy đảm bảo bạn có sự cho phép từ người thanh toán.\n\nBạn cũng cần đảm bảo thiết bị luôn được sạc. Nhà phát triển không chịu trách nhiệm nếu thiết bị hết pin và bạn không thể sử dụng ứng dụng.\n\nMặc dù Nhà phát triển nỗ lực cập nhật và duy trì ứng dụng chính xác, họ phụ thuộc vào thông tin từ bên thứ ba. Do đó, họ không chịu trách nhiệm cho bất kỳ thiệt hại nào phát sinh do bạn hoàn toàn dựa vào ứng dụng.\n\nỨng dụng có thể được cập nhật để tương thích với hệ điều hành của bạn. Bạn có thể cần tải bản cập nhật để tiếp tục sử dụng. Nhà phát triển không cam kết cập nhật liên tục, nhưng bạn đồng ý chấp nhận các bản cập nhật khi có. Nhà phát triển có quyền ngừng cung cấp ứng dụng mà không cần thông báo. Trong trường hợp đó, bạn phải ngừng sử dụng và có thể phải gỡ bỏ ứng dụng khỏi thiết bị.\n\n",
      "Changes_Terms_Conditions": "Thay đổi điều khoản & điều kiện\n",
      "Changes_Terms_Conditions_message": "Nhà phát triển có thể cập nhật các điều khoản và điều kiện theo thời gian. Bạn nên kiểm tra trang này định kỳ để biết các thay đổi. Bất kỳ thay đổi nào sẽ được thông báo bằng cách cập nhật trên trang này.\n\nCác điều khoản và điều kiện này có hiệu lực từ ngày 22 tháng 2 năm 2025.\n\n",
      "Contact_us": "Liên hệ\n",
      "Contact_us_message": "Nếu bạn có bất kỳ câu hỏi hoặc đề xuất nào liên quan đến điều khoản và điều kiện, vui lòng liên hệ qua email: 0623hoon@gmail.com\n\n",
      "Delete_Comment": "Xóa bình luận",
      "Delete_Comment_message": "Bạn có muốn xóa bình luận này không?",
      "LogOut_message": "Bạn có muốn đăng xuất không?",
      "Occupation_Input": "Nhập nghề nghiệp của bạn",
      "New_User": "Người dùng mới",
      "Edit": "Chỉnh sửa",
      "Post_Alert_message": "Vui lòng điền đầy đủ tất cả các mục",
      "Social_Login": "Đăng nhập bằng mạng xã hội",
      "All_Term": "Đồng ý tất cả điều khoản sử dụng",
      "All_Term_message": "Việc đồng ý toàn bộ nghĩa là bạn đồng ý với tất cả thông tin do P4U cung cấp riêng lẻ.",
      "Gender_Term": "Chúng tôi có thể thu thập thông tin tùy chọn về giới tính của bạn, bao gồm \"Nam\", \"Nữ\" hoặc \"Không xác định\".\n\nMục đích thu thập:\n- Hiểu rõ hơn về nhân khẩu học người dùng.\n- Cải thiện dịch vụ và trải nghiệm người dùng thông qua phân tích.\n- Đảm bảo sự đa dạng và hòa nhập trong thiết kế và nội dung.\n\nLựa chọn của bạn:\n- Việc cung cấp thông tin giới tính là hoàn toàn tự nguyện.\n- Bạn có thể chọn \"Không xác định\" hoặc không cung cấp thông tin.\n- Bạn có thể yêu cầu truy cập, cập nhật hoặc xóa thông tin giới tính bất cứ lúc nào bằng cách liên hệ với chúng tôi.",
      "Country_Term": "Chúng tôi có thể thu thập và sử dụng thông tin về vị trí của bạn:\n\nDữ liệu vị trí có thể được thu thập qua địa chỉ IP, Wi-Fi hoặc các công nghệ khác trên thiết bị của bạn.\n\nDữ liệu này được sử dụng để cung cấp dịch vụ dựa trên vị trí, cải thiện trải nghiệm người dùng, nâng cao dịch vụ và phục vụ cho mục đích phân tích.\n\nChúng tôi không chia sẻ dữ liệu vị trí chính xác với bên thứ ba nếu không có sự đồng ý rõ ràng của bạn, trừ khi bị yêu cầu bởi pháp luật hoặc để cung cấp dịch vụ bạn yêu cầu.",
      "Mandatory": "Bắt buộc",
      "SNS_Term": "Đồng ý chia sẻ thông tin cá nhân với bên thứ ba",
      "User_Term": "Người dùng có thể báo cáo câu hỏi hoặc bình luận không phù hợp. Người dùng bị 3 người báo cáo sẽ bị chặn tài khoản vì lạm dụng.",
      "Age_Term": "Thu thập thông tin tuổi\nChúng tôi có thể thu thập tuổi của bạn khi đăng ký để điều chỉnh nội dung, quảng cáo và dịch vụ phù hợp với sở thích của bạn.\n\nPhạm vi tuổi:\nĐược sử dụng để phân tích và hiểu rõ người dùng hơn.\n\nNội dung và quảng cáo cá nhân hóa:\nDựa vào tuổi để cung cấp nội dung và quảng cáo phù hợp hơn.\n\nCách sử dụng thông tin:\n- Tổng hợp để phân tích nội bộ và cải thiện ứng dụng\n- Cung cấp trải nghiệm người dùng tốt hơn theo độ tuổi\n\nBảo mật dữ liệu:\n- Dữ liệu được lưu trữ an toàn và không chia sẻ với bên thứ ba nếu không có sự đồng ý rõ ràng của bạn.\n\nQuyền của bạn:\n- Bạn có quyền cập nhật hoặc xóa thông tin cá nhân, bao gồm cả dữ liệu tuổi, bất kỳ lúc nào.",
      "Term_Button": "Đồng ý để tiếp tục",
      "See_detail": "Xem chi tiết",
      "User_Provided_information": "Thông tin do người dùng cung cấp",
      "Term_bottom_message": "Người dùng cũng có thể xóa tài khoản của mình. Sau khi xóa, tất cả câu hỏi và bình luận cũng sẽ bị xóa.",
      "User_logout_message": "Người dùng đã đăng xuất",
      "Question_deleted_message": "Câu hỏi đã được xóa",
      "Comment_deleted_message": "Bình luận đã được xóa",
      "Account_deleted_message": "Tài khoản đã bị xóa",
      "Reported_Question_message": "Câu hỏi bị báo cáo",
      "Reported_Comment_message": "Bình luận bị báo cáo",
      "Question_created_message": "Câu hỏi đã được tạo",
      "Question_updated_message": "Câu hỏi đã được cập nhật",
      "Question_created_error_message": "Không thể tạo câu hỏi",
      "OAuth2Login_error_message": "Không có phản hồi từ đăng nhập mạng xã hội",
      "QAuth2Login_error_login_message": "Đăng nhập thất bại",
      "GetUserDetail_error_message": "Không thể lấy thông tin người dùng",
      "PostQuestion_error_message": "Không thể tạo câu hỏi",
      "UpdateQuestion_error_message": "Không thể cập nhật câu hỏi"
    }
  }
}
